GitHub.vscode-pull-request-github
charliermarsh.ruff
eamodio.gitlens
emaishoaib.python-codelens
emaishoaib.workshop-sync
hashicorp.terraform
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vsliveshare.vsliveshare
natqe.reload
usernamehw.errorlens
